trade_exp/src/Enums/ВариантыОбеспечения/ВариантыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="9b0356bb-5966-4577-ab5a-bbc09ae9323b">
    <name>Отгрузить</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="865e7fe8-0ba5-430f-8819-98ee2644d5c5">
    <name>НеТребуется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4ed96c3e-4885-4c35-b010-4d22e1d10826">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="cd44cebd-862f-40b1-a297-247d05c45d2f">
    <name>СоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="970e966f-77d3-4ec1-9ca5-f2f5a2a8e2d1">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/CommonModules/ОбеспечениеВДокументахКлиентСервер/Module.bsl
&Вместо("ВариантОбеспеченияИФлагОбособленноПоУмолчанию")
Функция Док_ВариантОбеспеченияИФлагОбособленноПоУмолчанию(ЗаполнятьОбособленно)
	КОбеспечению   = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.КОбеспечению");
	НеОбеспечивать = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.НеТребуется");
	
	Результат = Новый Структура();  
	//Альтерра Светлакова задача №59485 (обеспечение номенклатуры по умолчанию "Не обеспечивать")
	Результат.Вставить("Товар",  Новый Структура("ВариантОбеспечения,Обособленно", НеОбеспечивать, Ложь));
	Результат.Вставить("Тара",   Новый Структура("ВариантОбеспечения,Обособленно", КОбеспечению,   Ложь));
	Результат.Вставить("Работа", Новый Структура("ВариантОбеспечения,Обособленно", НеОбеспечивать, Ложь));
	Результат.Вставить("Услуга", Новый Структура("ВариантОбеспечения,Обособленно", НеОбеспечивать, Ложь));
	
	Если ЗаполнятьОбособленно Тогда
		
		Результат.Товар.Обособленно         = Истина;
		Результат.Работа.Обособленно        = Истина;
		Результат.Работа.ВариантОбеспечения = КОбеспечению;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
